//
//  PWKeepViewModel.m
//  PWNote
//
//  Created by 明妍 on 2018/12/2.
//  Copyright © 2018 明妍. All rights reserved.
//

#import "PWKeepViewModel.h"

@implementation PWKeepViewModel

- (NSString *)title {
    return @"biaoti";
}

- (NSString *)content {
    return @"寥落古行宫，宫花寂寞红。白头宫女在，闲坐说玄宗。寥落古行宫，宫花寂寞红。白头宫女在，闲坐说玄宗。寥落古行宫，宫花寂寞红。白头宫女在，闲坐说玄宗。寥落古行宫，宫花寂寞红。白头宫女在，闲坐说玄宗。寥落古行宫，宫花寂寞红。白头宫女在，闲坐说玄宗。寥落古行宫，宫花寂寞红。白头宫女在，闲坐说玄宗。寥落古行宫，宫花寂寞红。白头宫女在，闲坐说玄宗。寥落古行宫，宫花寂寞红。白头宫女在，闲坐说玄宗。寥落古行宫，宫花寂寞红。白头宫女在，闲坐说玄宗。寥落古行宫，宫花寂寞红。白头宫女在，闲坐说玄宗。寥落古行宫，宫花寂寞红。白头宫女在，闲坐说玄宗。寥落古行宫，宫花寂寞红。白头宫女在，闲坐说玄宗。寥落古行宫，宫花寂寞红。白头宫女在，闲坐说玄宗。寥落古行宫，宫花寂寞红。白头宫女在，闲坐说玄宗。寥落古行宫，宫花寂寞红。白头宫女在，闲坐说玄宗。寥落古行宫，宫花寂寞红。白头宫女在，闲坐说玄宗。寥落古行宫，宫花寂寞红。白头宫女在，闲坐说玄宗。寥落古行宫，宫花寂寞红。白头宫女在，闲坐说玄宗。寥落古行宫，宫花寂寞红。白头宫女在，闲坐说玄宗。寥落古行宫，宫花寂寞红。白头宫女在，闲坐说玄宗。寥落古行宫，宫花寂寞红。白头宫女在，闲坐说玄宗。寥落古行宫，宫花寂寞红。白头宫女在，闲坐说玄宗。寥落古行宫，宫花寂寞红。白头宫女在，闲坐说玄宗。";
}

- (Class)itemViewClass {
    return NSClassFromString(@"PWKeepItemView");
}

- (CGSize)itemSize {
    //TODO: wmy
    return CGSizeMake(kScreenWidth, 100);
}

@end
